from lang_pack import LangPack

SLOVAK = LangPack(
    name="slovak",
    input_chars=frozenset(
        {
            "!", "\"", ",", "-", ".", ":", ";", "?", "A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O", "P", "R", "S", "T", "U", "V", "W", "Y", "Z", "`", "a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z", "¨", "Á", "Í", "Ú", "á", "ä", "é", "í", "ó", "ô", "ö", "ú", "ý", "Č", "č", "Ď", "ď", "ĺ", "Ľ", "ľ", "Ň", "ň", "ŕ", "Š", "š", "Ť", "ť", "Ž", "ž", "–", "“", "„",
        }
    ),
    output_tokens=(
        "∅",  # null token (CTC blank)
        "'", "-", "a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z", "à", "â", "ã", "ä", "æ", "ç", "ì", "í", "î", "ð", "õ", "ø", "ù", "ú", "û", "ĕ", "ħ", "ĩ", "ŋ", "œ", "ũ", "ɋ", "ɐ", "ɑ", "ɒ", "ɓ", "ɔ", "ɕ", "ə", "ɚ", "ɛ", "ɜ", "ɟ", "ɠ", "ɢ", "ɣ", "ɤ", "ɦ", "ɨ", "ɪ", "ɫ", "ɬ", "ɭ", "ɯ", "ɱ", "ɲ", "ɴ", "ɹ", "ɾ", "ʁ", "ʂ", "ʃ", "ʄ", "ʈ", "ʉ", "ʊ", "ʋ", "ʌ", "ʎ", "ʏ", "ʐ", "ʑ", "ʒ", "ʔ", "ʝ", "ʟ", "ʧ", "ʰ", "ʱ", "ʲ", "ˀ", "ˈ", "ˌ", "ː", "˔", "˞", "ˤ", "˥", "˦", "˧", "˨", "˩", "̀", "́", "̃", "̊", "̚", "̝", "̞", "̟", "̠", "̥", "̨", "̩", "̪", "̯", "̺", "̻", "β", "θ", "χ", "ẽ",
    ),
    extra_chars=frozenset(),
    strip_accents=False,
)
